Autodesk.Revit.DB.BuiltInFailures.StructuralAssetFailures.StructuralMaterialAssetInvalid
Material assigned to the Analytical Element does not contain Structure parameters - verify material content.

Autodesk.Revit.DB.BuiltInFailures.StructuralAssetFailures
Failures related to structural materials.